In [1]:
import pandas as pd
import numpy as np


# Create a sample dataset with missing values
data = {
    'A': [1, 2, 100, 4, 5],
    'B': [3, np.nan, 7, 8, 9],
    'C': [np.nan, 12, 13, 14, 15],
    'D': [16, 17, 18, np.nan, 20]
}


# Convert the dictionary to a Pandas DataFrame
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
     A    B     C     D
0    1  3.0   NaN  16.0
1    2  NaN  12.0  17.0
2  100  7.0  13.0  18.0
3    4  8.0  14.0   NaN
4    5  9.0  15.0  20.0

In [3]:
df.isnull()

       A      B      C      D
0  False  False   True  False
1  False   True  False  False
2  False  False  False  False
3  False  False  False   True
4  False  False  False  False

In [4]:
df

     A    B     C     D
0    1  3.0   NaN  16.0
1    2  NaN  12.0  17.0
2  100  7.0  13.0  18.0
3    4  8.0  14.0   NaN
4    5  9.0  15.0  20.0

In [6]:
df.isnull().sum()

A    0
B    1
C    1
D    1
dtype: int64

In [7]:
df.dropna()

     A    B     C     D
2  100  7.0  13.0  18.0
4    5  9.0  15.0  20.0